Public Attributes | List of all members
API_BeamType Struct Reference
Element Manager
Represents a beam element. More...
#include <APIdefs_Elements.h>
 Public Attributes
 API_Elem_Head  | head
General element header.
 short  | aboveViewLinePen
Pen index of the overhead lines.
 API_AttributeIndex  | aboveViewLineType
Linetype of the overhead lines.
 API_AttributeIndex  | refLtype
The linetype index of the reference line.
 short  | refPen
The pen index of the reference line.
 short  | cutContourLinePen
The pen index of the cut lines of the beam.
 API_AttributeIndex  | cutContourLineType
The line type index of the beam section contour line.
 Int32  | sequence
Sequence is required when two beams meet with the same priority or when 3 or more beams meet in a junction. Its values can be between 0 and 999.
 API_OverriddenPen  | cutFillPen
Cut fill pens set in the used structure (building material, complex profile) can be overridden on the element level.
 API_OverriddenPen  | cutFillBackgroundPen
Cut fill pens set in the used structure (building material, complex profile) can be overridden on the element level.
 API_StoryVisibility  | visibility
The option to define on which stories display the beam.
 API_LinkToSettings  | linkToSettings
Mode of linking to home story.
 API_BHoleTypeID  | holeType
The shape of the beam hole (see API_BHoleTypeID).
 bool  | holeContureOn
Show the hole's contour on the plan.
 bool  | isAutoOnStoryVisibility
Recalculate the story visibility automatically according to the actual elevation of the beam.
 double  | holeWidth
The default width of the holes.
 double  | holeHeight
The default height of the holes (effective only for the rectangle type - holeType is APIBHole_Rectangular).
 double  | holeLevel
The default level of the holes: the distance between the center of the hole and the top of the beam.
 double  | offset
The offset of beam's reference line from the center.
 double  | level
The top height of the beam relative to the floor level.
 API_BeamVisibleLinesID  | showContourLines
Show the contour lines of the beam.
 API_BeamVisibleLinesID  | showReferenceAxis
Show the reference axis of the beam.
 API_Coord  | begC
The beginning (start) coordinate of the beam.
 API_Coord  | endC
The end coordinate of the beam.
 double  | curveAngle
The arc angle of the curved beam between begC and endC (negative value results an arc on the opposite side). This value is always zero for straight beams.
 double  | verticalCurveHeight
The height of the vertical curvature of the beam.
 API_AttributeIndex  | hiddenLineType
Hidden line type.
 short  | hiddenLinePen
Hidden line pen.
 short  | anchorPoint
Anchor point of the beam. |0|1|2| |3|4|5| |6|7|8|.
 API_AttributeIndex  | belowViewLineType
Linetype of the uncut lines.
 short  | belowViewLinePen
Pen index of the uncut lines.
 bool  | isFlipped
Defines whether the beam is mirrored. Applies to profiled beams only.
 bool  | isSlanted
Defines whether the beam is slanted.
 double  | slantAngle
Slant angle.
 double  | profileAngle
Profile rotating angle around it's center line.
 API_BeamShapeTypeID  | beamShape
Type to define if beam is straight, horizontally or vertically curved.
 API_ElemDisplayOptionsID  | displayOption
Display options of the element on the floor plan.
 API_ElemViewDepthLimitationsID  | viewDepthLimitation
Defines the range within the element is shown on the floor plan.
 API_ElemProjectionModesID  | uncutProjectionMode
Uncut projection mode.
 API_ElemProjectionModesID  | overheadProjectionMode
Overhead projection mode.
 UInt32  | nSegments
Number of segments.
 UInt32  | nCuts
Number of cuts.
 UInt32  | nSchemes
Number of schemes.
 UInt32  | nProfiles
Number of profiles.
 bool  | useCoverFill
Use Floor plan fill.
 bool  | useCoverFillFromSurface
Use the fill attribute assigned to the surface material of the element.
 bool  | coverFillOrientationComesFrom3D
Use cover fill orientation from 3D element view.
 API_AttributeIndex  | coverFillType
Type of the cover fill.
 short  | coverFillForegroundPen
Foreground pen of the cover fill.
 short  | coverFillBackgroundPen
Background pen of the cover fill.
 API_CoverFillTransformationTypeID  | coverFillTransformationType
TransformationType of the fill.
 API_CoverFillTransformation  | coverFillTransformation
Orientation and distortion parameters of the cover fill.
Detailed Description
Represents a beam element.
Remarks
The elements' structure type is defined with the new modelElemStructureType member. The related attribute indices are separated into buildingMaterial and profileAttr. The elements' cut fill foreground and background pens inherit from the element structure and can be overridden on the element level. The elements' surface materials inherit from the element structure and can be overridden on the element level. For beam-related memo data see the ACAPI_Element_GetMemo function.